;; -*- no-byte-compile: t; -*-
;;; ~/dev/dotfiles/emacs/.doom.d/packages.el

(package! async)
(package! cider)
(package! clj-refactor)
(package! clojure-mode)
;; (package! company)
;; (package! company-lsp)
(package! dap-mode)
(package! dart-mode)
(package! flutter)
(package! flycheck-clojure)
(package! flycheck-clj-kondo :disable t)
(package! flycheck-package)
(package! hover)
;;(package! lsp-dart :recipe (:host github :repo "emacs-lsp/lsp-dart" :branch "master"))
(package! lsp-dart :recipe (:local-repo "~/dev/lsp-dart" :files ("*.el") :no-byte-compile t))
(package! lsp-java)
;; (package! lsp-mode :recipe (:local-repo "~/dev/lsp-mode" :files ("*.el") :no-byte-compile t))
;; (package! lsp-mode)
(package! lsp-mode :recipe (:host github :repo "ericdallo/lsp-mode" :branch "remove-migrated-lsp-dart"))
(package! lsp-ui)
(package! treemacs)
(package! lsp-treemacs)
(package! nyan-mode)
(package! scss-mode)
(package! paredit)
(package! parrot :recipe (:host github :repo "jnc-nj/parrot" :branch "master"))
